---
kind: method
id: M:Autodesk.Revit.DB.ModelPath.GetModelGUID
source: html/e28d439d-1399-8a88-7345-109252fb68e6.htm
---
# Autodesk.Revit.DB.ModelPath.GetModelGUID Method

A GUID identifying the Revit cloud model.

## Syntax (C#)
```csharp
public Guid GetModelGUID()
```